---
kind: property
id: P:Autodesk.Revit.DB.Visual.SchemaCommon.Description
source: html/61127563-0fcd-7d46-0115-5a97315736ed.htm
---
# Autodesk.Revit.DB.Visual.SchemaCommon.Description Property

The property labeled "Description" common to all visual Asset types.

## Syntax (C#)
```csharp
public static string Description { get; }
```

## Remarks
This property is of type "AssetPropertyString".